*----------------------------------------------------------------------*
*                         TREINAMENTO                                  *
*----------------------------------------------------------------------*
* Autor....: Wesley Constantino dos Santos                             *
* Data.....: 28.11.2022                                                *
* Módulo...: TR                                                        *
* Descrição: Testes                                                    *
*----------------------------------------------------------------------*
*                    Histórico das Alterações                          *
*----------------------------------------------------------------------*
* DATA      | AUTOR             | Request    | DESCRIÇÃO               *
*----------------------------------------------------------------------*
*           |                   |            |                         *
*----------------------------------------------------------------------*


INCLUDE mztrmpwes001top                         .  " global Data   
INCLUDE mztrmpwes001o01                         .  " PBO-Modules
INCLUDE mztrmpwes001i01                         .  " PAI-Modules
INCLUDE mztrmpwes001f01                         .  " FORM-Routines
